#Task3
country={
    "Кыргызстан":["Бишкек","Ош"],
    "Казакстан":["Нур-Султан","Алмата"],
    "Турция":["Стамбул","Анкара"],
    "Англия":["Логдон","Манчестер"],
    "Германия":["Мюнхен","Гамбург"]

}
city=input("Введите город:")
for i,j in country.items():
    if city in j:
        print(f'{city}  это город в {i} ')
        break

else:
        print(f'{city} извините этого города в нашем списке нет')

Task2
currency = {
 "рубль": 1.5,
 "доллар": 85,
 "евро": 92,
 "тенге": 0.72,
 "сум": 0.0074
}
d=int(input("Введите сумму для конвертации: "))
for k,l in currency.items():
 print(f'{d} рубль сомах будет:{d*l} сомах')






